[
  "obsidian-zotero-desktop-connector",
  "dataview",
  "supercharged-links-obsidian",
  "calendar",
  "obsidian-git",
  "obsidian-kanban",
  "excalibrain",
  "obsidian-excalidraw-plugin",
  "obsidian-local-rest-api",
  "mermaid-tools",
  "templater-obsidian",
  "quickadd",
  "periodic-notes",
  "advanced-canvas"
]