- Be Well, 1x2
- B12 Active, 1 x1
- Pure D3, 0.5ml x1 
-απο natural 

- Gentle iron (Solgar) , 1x2
- Magnesium citrate 200mg (Now), 1x1
- Natural Vitamin E 1000Iu (Solgar), 1x1
- Glucosamine - Chondroitin - MSM (Now), 1x2
- Glutamine 500mg, 1x1 για 1 μήνα, στη συνέχεια 1x2 για 1 μήνα και δταθεροποιηση σε 1x3

- Βαμμα Τσουκνίδας, 20 σταγόνες 3 φορες την ημερα σε νερό νηστικη
Απο Φαρμακείο ή online 

- Μαγειρική σόδα 1/2 κουτ. Γλυκου 1-2 φορές την ημέρα 
- Ηλεκτρολύτες: Νερό + Λεμόνι (ακόμα και ολόκληρο) + Φυσικό Ανθό Άλατος 1.5 λίτρο ημερησίως 
- Υποστηρικτικα: Μελίσσοχόρτο, Χαμομήλι, Γανοδερμα, Δυόσμος, Τζιντζερ βρασμένο 

- Συκωτι μοσχαρίσιο 1-2 φορές την εβδομάδα 